In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
amc_file = "AMC.csv"
amc_df = pd.read_csv(amc_file)
amc_df.head()

         Date       Open       High        Low      Close  Adj Close   Volume
0  12/18/2013  19.180000  19.790001  18.900000  18.900000  13.593409  5457200
1  12/19/2013  18.900000  19.490000  18.809999  19.490000  14.017757  1605400
2  12/20/2013  19.650000  19.770000  19.400000  19.680000  14.154412   737100
3  12/23/2013  19.790001  19.990000  19.500000  19.740000  14.197559   698100
4  12/24/2013  19.740000  19.820000  19.500000  19.530001  14.046524   213700

In [4]:
nasdaq_file = "^IXIC.csv"
nasdaq_df = pd.read_csv(nasdaq_file)
nasdaq_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,12/18/2013,4024.669922,4070.379883,3979.590088,4070.060059,4070.060059,2178330000
1,12/19/2013,4059.340088,4063.699951,4045.409912,4058.139893,4058.139893,1813050000
2,12/20/2013,4064.889893,4111.930176,4064.729980,4104.740234,4104.740234,3510420000
3,12/23/2013,4136.149902,4149.310059,4127.720215,4148.899902,4148.899902,1779400000
4,12/24/2013,4150.640137,4155.620117,4147.149902,4155.419922,4155.419922,802270000

In [5]:
clean_amc = amc_df.drop(columns=['Open', 'High', 'Low', 'Adj Close'])
clean_amc.head()

         Date      Close   Volume
0  12/18/2013  18.900000  5457200
1  12/19/2013  19.490000  1605400
2  12/20/2013  19.680000   737100
3  12/23/2013  19.740000   698100
4  12/24/2013  19.530001   213700

In [6]:
clean_nasdaq = nasdaq_df.drop(columns=['Open', 'High', 'Low', 'Adj Close'])
clean_nasdaq.head()

         Date        Close      Volume
0  12/18/2013  4070.060059  2178330000
1  12/19/2013  4058.139893  1813050000
2  12/20/2013  4104.740234  3510420000
3  12/23/2013  4148.899902  1779400000
4  12/24/2013  4155.419922   802270000

In [7]:
rds_connection_string = "postgres:********$@localhost:5432/amc"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [8]:
clean_amc.to_sql(name='amc_1', con=engine, if_exists='append', index=False)

In [9]:
clean_nasdaq.to_sql(name='nasdaq_1', con=engine, if_exists='append', index=False)

In [10]:
clean_amc.dtypes

Date       object
Close     float64
Volume      int64
dtype: object